tutorials/multiphaseReactiveTransport/interReactiveTransferFoam/2DCavity/constant/thermoPhysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermoPhysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
Phase1 phreeqcMixture;
Phase2 inertMultiComponentMixture;
PhaseTransfer true;

solutionSpecies
{
        CO2	
	{
		D1 D1 [ 0 2 -1 0 0 0 0 ] 1.6e-7;
		D2 D2 [ 0 2 -1 0 0 0 0 ] 0;
		H H [ 0 0 0 0 0 0 0 ] 1.25;
                Mw Mw [ 1 0 0 0 -1 0 0 ] 44;
	}

        H+
        {
                D1 D1 [ 0 2 -1 0 0 0 0 ] 9.83e-7;
                D2 D2 [ 0 2 -1 0 0 0 0 ] 0;
                H H [ 0 0 0 0 0 0 0 ] 1e-9;
                Mw Mw [1 0 0 0 -1 0 0] 1;
        }


        OH-
        {
                D1 D1 [ 0 2 -1 0 0 0 0 ] 5.27e-7;
                D2 D2 [ 0 2 -1 0 0 0 0 ] 0;
                H H [ 0 0 0 0 0 0 0 ] 1e-9;
                Mw Mw [1 0 0 0 -1 0 0] 17;
        }

        CO3-2 
        {
                D1 D1 [ 0 2 -1 0 0 0 0 ] 0.955e-7;
                D2 D2 [ 0 2 -1 0 0 0 0 ] 0;
                H H [ 0 0 0 0 0 0 0 ] 1e-9;
                Mw Mw [1 0 0 0 -1 0 0] 60;
        }


        HCO3-
        {
                D1 D1 [ 0 2 -1 0 0 0 0 ] 5.27e-7;
                D2 D2 [ 0 2 -1 0 0 0 0 ] 0;
                H H [ 0 0 0 0 0 0 0 ] 1e-9;
                Mw Mw [1 0 0 0 -1 0 0] 61;
        }

        



};

surfaceSpecies
{
}

surfaceMasters
{
}
// ************************************************************************* //
